In [1]:
#importing pandas library alias as pd
import pandas as pd

In [2]:
#reading csv file
df = pd.read_csv('info.csv')

In [3]:
df  # see the csv file

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [4]:
# extract Nan values and replace them
from sklearn.preprocessing import Imputer

In [5]:
Imp=Imputer(missing_values='NaN',strategy='mean',axis=0)
                                                #column oriented also provided by default

/usr/local/lib/python3.6/dist-packages/sklearn/utils/deprecation.py:66: DeprecationWarning: Class Imputer is deprecated; Imputer was deprecated in version 0.20 and will be removed in 0.22. Import impute.SimpleImputer from sklearn instead.
  warnings.warn(msg, category=DeprecationWarning)

In [7]:
x=df.iloc[:,1].values   # column number 2

In [8]:
x

array([44., 27., 30., 38., 40., 35., nan, 48., 50., 37.])

In [7]:
y = df.iloc[:,2].values
y

array([72000., 48000., 54000., 61000.,    nan, 58000., 52000., 79000.,
       83000., 67000.])

In [9]:
features = df.iloc[:,0:3]
features

   Country   Age   Salary
0   France  44.0  72000.0
1    Spain  27.0  48000.0
2  Germany  30.0  54000.0
3    Spain  38.0  61000.0
4  Germany  40.0      NaN
5   France  35.0  58000.0
6    Spain   NaN  52000.0
7   France  48.0  79000.0
8  Germany  50.0  83000.0
9   France  37.0  67000.0

In [36]:
#features 
label = df.iloc[:,-1]
label
# to train the model labels are actual answers

0     No
1    Yes
2     No
3     No
4    Yes
5    Yes
6     No
7    Yes
8     No
9    Yes
Name: Purchased, dtype: object

In [11]:
feature1=features.iloc[:,1:3]
#features.iloc[:,1:3]

    Age   Salary
0  44.0  72000.0
1  27.0  48000.0
2  30.0  54000.0
3  38.0  61000.0
4  40.0      NaN
5  35.0  58000.0
6   NaN  52000.0
7  48.0  79000.0
8  50.0  83000.0
9  37.0  67000.0

In [14]:
imp = Imp.fit(feature1)  # this is fit method to load the columns with NaN values

In [15]:
# transform 
t=imp.transform(feature1)  # this will transform the columns according to above Imputer feature

In [16]:
t

array([[4.40000000e+01, 7.20000000e+04],
       [2.70000000e+01, 4.80000000e+04],
       [3.00000000e+01, 5.40000000e+04],
       [3.80000000e+01, 6.10000000e+04],
       [4.00000000e+01, 6.37777778e+04],
       [3.50000000e+01, 5.80000000e+04],
       [3.87777778e+01, 5.20000000e+04],
       [4.80000000e+01, 7.90000000e+04],
       [5.00000000e+01, 8.30000000e+04],
       [3.70000000e+01, 6.70000000e+04]])

In [19]:
features.iloc[:,1:3] = t[:,:]
features.iloc[:,1:3]

         Age        Salary
0  44.000000  72000.000000
1  27.000000  48000.000000
2  30.000000  54000.000000
3  38.000000  61000.000000
4  40.000000  63777.777778
5  35.000000  58000.000000
6  38.777778  52000.000000
7  48.000000  79000.000000
8  50.000000  83000.000000
9  37.000000  67000.000000

In [20]:
df.iloc[:,1:3] =features.iloc[:,1:3]

In [37]:
df['Age'],df['Salary'] = df["Age"].astype("int"),df["Salary"].astype("int")  #converting the decimal data into integer value

In [38]:
df   # cleaned data

   Country  Age  Salary Purchased
0   France   44   72000        No
1    Spain   27   48000       Yes
2  Germany   30   54000        No
3    Spain   38   61000        No
4  Germany   40   63777       Yes
5   France   35   58000       Yes
6    Spain   38   52000        No
7   France   48   79000       Yes
8  Germany   50   83000        No
9   France   37   67000       Yes